import unittest
def area(a,b):
    '''
            Возвращает произведение двух десятичных чисел.
                       Параметры:
                           a (float) : десятичное число
                           b (float) : десятичное число

            Возвращаемое значение:
                           area (float): площадь прямоугольника со сторонами a и b
    '''
    return a*b

def perimeter(a,b):
    '''
                Возвращает удвоенную сумму двух десятичных чисел.
                           Параметры:
                               a (float) : десятичное число
                               b (float) : десятичное число

                Возвращаемое значение:
                               perimeter (float): периметр прямоугольника со сторонами a и b
        '''
    return (a+b)*2

