def area(a,b):
    '''
            Возвращает произведение двух десятичных чисел.
                       Параметры:
                           a (double) : десятичное число
                           b (double) : десятичное число

            Возвращаемое значение:
                           area (double): площадь прямоугольника со сторонами a и b
    '''
    return a*b
def perimeter(a,b):
    '''
                Возвращает удвоенную сумму двух десятичных чисел.
                           Параметры:
                               a (double) : десятичное число
                               b (double) : десятичное число

                Возвращаемое значение:
                               perimeter (double): периметр прямоугольника со сторонами a и b
        '''
    return (a+b)*2
