
def area(a):
    '''
        Возвращает квадрат десятичного числа.
                   Параметр:
                       a (double) : десятичное число

        Возвращаемое значение:
                       area (double): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
            Возвращает учетверённое десятичное число.
                       Параметр:
                           a (double) : десятичное число

            Возвращаемое значение:
                           perimeter (double): периметр квадрата со стороной a
    '''

    return 4 * a
