import unittest
def area(a):
    '''
        Возвращает квадрат десятичного числа.
                   Параметр:
                       a (float) : десятичное число

        Возвращаемое значение:
                       area (float): площадь квадрата со стороной a
    '''
    return a * a


def perimeter(a):
    '''
            Возвращает учетверённое десятичное число.
                       Параметр:
                           a (float) : десятичное число

            Возвращаемое значение:
                           perimeter (float): периметр квадрата со стороной a
    '''

    return 4 * a


