def area(a,h):
    '''
            Возвращает полупроизведение двух десятичных чисел.
                       Параметры:
                           a (double) : десятичное число
                           h (double) : десятичное число

            Возвращаемое значение:
                           area (double): площадь треугольника со стороной a и высотой h
    '''
    return a*h/2
def perimeter(a,b,c):
    '''
                Возвращает сумму трёх десятичных чисел.
                           Параметры:
                               a (double) : десятичное число
                               b (double) : десятичное число
                               c (double) : десятичное число
                Возвращаемое значение:
                               perimeter (double): периметр треугольника со сторонами a, b и
    '''
    return a+b+c