def area(a,h):
    '''
            Возвращает полупроизведение двух десятичных чисел.
                       Параметры:
                           a (float) : десятичное число
                           h (float) : десятичное число

            Возвращаемое значение:
                           area (float): площадь треугольника со стороной a и высотой h
    '''
    return a*h/2
def perimeter(a,b,c):
    '''
                Возвращает сумму трёх десятичных чисел.
                           Параметры:
                               a (float) : десятичное число
                               b (float) : десятичное число
                               c (float) : десятичное число
                Возвращаемое значение:
                               perimeter (float): периметр треугольника со сторонами a, b и
    '''
    return a+b+c